## Plan Result (853: prod - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_definition.custom_roles[&#34;Azure Contributor Role minus deletes&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_definition.custom_roles["Azure Contributor Role minus deletes"] will be created
  + resource "azurerm_role_definition" "custom_roles" {
      + assignable_scopes           = (known after apply)
      + description                 = "Allow all standard contributor access minus any delete actions"
      + id                          = (known after apply)
      + name                        = "Azure Contributor Role minus deletes"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/HMCTS"

      + permissions {
          + actions     = [
              + "*",
            ]
          + not_actions = [
              + "*/delete",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":144,"Program":"tfcmt","SHA1":"","Target":"853: prod - TerraformPlanApply","Vars":{}} -->